app/Controllers/BukuTamu.php

SELECT *
FROM `bukutamu`
WHERE `tamuuser` = 'tino'
---
    public function index()
    {
        $userid = session()->userid;
        $modelbukuhp = new ModelBukuTamu();

        $data = [
            'title' => '| Buku Tamu',
            'tampildata'    => $modelbukuhp->where('tamuuser', $userid)->findAll()

SELECT *
FROM `bukutamu`
WHERE `bukutamu`.`tamuid` = '1'
---
    public function formedit($tamuid)
    {
        $modelbuku = new ModelBukuTamu();
        $dataEdit = $modelbuku->find($tamuid);

SELECT *
FROM `bukutamu`
WHERE `tamuhp` = '+6285810100900'
---
            return redirect()->to(site_url('bukutamu/formedit/' . $tamuid))->withInput()->with('validation', $validation);
        } else {
            $modelbuku = new ModelBukuTamu();
            $cariDataBuku = $modelbuku->where('tamuhp', $tamuhp)->findAll();