app/Controllers/Main.php

SELECT *
FROM `barang`
WHERE `barang`.`brgid` = '1'
SELECT *
FROM `kategori`
WHERE `kategori`.`katid` = '1'
SELECT *
FROM `subkategori`
WHERE `subkategori`.`subkatid` = '3'
---
    public function detailbarang($brgid)
    {
        $modelBarang = new ModelBarang();
        $cekData = $modelBarang->find($brgid);

        $modelKategori = new ModelKategori();
        $cekKat = $modelKategori->find($cekData['brgkat']);

        $modelsubkategori = new ModelSubKategori();
        $cekSubKat = $modelsubkategori->find($cekData['brgsubkat']);