app/Controllers/Mempelai.php

    public function satu()
    {

        $userid = session()->userid;
        $modelMempelaiSatu = new ModelMempelaiSatu();
        $data = [
            'title' => '| Mempelai',
            'tampildata' => $modelMempelaiSatu->where('nikahsatuuser', $userid)->findAll()
        ];
---
SELECT *
FROM `mempelaisatu`
WHERE `nikahsatuuser` = 'ADMIN'
SELECT *
FROM `mempelaisatu`
WHERE `nikahsatuuser` = 'tino'

    public function formtambahsatu()
    {

        $userid = session()->userid;
        $modelMempelaiSatu = new ModelMempelaiSatu();
        $data = [
            'title' => 'Mempelai',
            'userid' => $userid,
            'tampildata' => $modelMempelaiSatu->where('nikahsatuuser', $userid)->findAll()
---
SELECT *
FROM `mempelaisatu`
WHERE `nikahsatuuser` = 'tino'

    public function dua()
    {

        $userid = session()->userid;
        $modelMempelaiDua = new ModelMempelaiDua();
        $data = [
            'title' => '| Mempelai',
            'tampildata' => $modelMempelaiDua->where('nikahduauser', $userid)->findAll()
---
SELECT *
FROM `mempelaidua`
WHERE `nikahduauser` = 'tino'

    public function formtambahdua()
    {

        $userid = session()->userid;
        $modelMempelaiDua = new ModelMempelaiDua();
        $data = [
            'title' => 'Mempelai',
            'userid' => $userid,
            'tampildata' => $modelMempelaiDua->where('nikahduauser', $userid)->findAll()
---
SELECT *
FROM `mempelaidua`
WHERE `nikahduauser` = 'tino'