app/Controllers/Undangan.php

SELECT *
FROM `users`
WHERE `users`.`userid` = 'lela'
---
    public function index($userid)
    {
        $modelUser = new ModelUsers();
        $cekDataUser = $modelUser->find($userid);