app/Models/ModelBarang.php

SELECT *
FROM `barang`
JOIN `kategori` ON `brgkat`=`katid`
JOIN `subkategori` ON `brgsubkat`=`subkatid`
---
    public function tampildata()
    {
        return $this->table('barang')->join('kategori', 'brgkat=katid')->join('subkategori', 'brgsubkat=subkatid')->get();